RT-Thread/rt-thread/bsp/freescale/platform/devices/MK40D10/include/MK40D10_extension.h
/*! @brief Set the WF18 field to a new value. */
#define LCD_WR_WF_WF18(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF18_MASK, LCD_WF_WF18(value)))
#define LCD_BWR_WF_WF18(base, index, value) (LCD_WR_WF_WF18(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF38[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P38 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF38 field. */
#define LCD_RD_WF_WF38(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF38_MASK) >> LCD_WF_WF38_SHIFT)
#define LCD_BRD_WF_WF38(base, index) (LCD_RD_WF_WF38(base, index))

/*! @brief Set the WF38 field to a new value. */
#define LCD_WR_WF_WF38(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF38_MASK, LCD_WF_WF38(value)))
#define LCD_BWR_WF_WF38(base, index, value) (LCD_WR_WF_WF38(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF22[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P22 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF22 field. */
#define LCD_RD_WF_WF22(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF22_MASK) >> LCD_WF_WF22_SHIFT)
#define LCD_BRD_WF_WF22(base, index) (LCD_RD_WF_WF22(base, index))

/*! @brief Set the WF22 field to a new value. */
#define LCD_WR_WF_WF22(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF22_MASK, LCD_WF_WF22(value)))
#define LCD_BWR_WF_WF22(base, index, value) (LCD_WR_WF_WF22(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF34[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P34 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF34 field. */
#define LCD_RD_WF_WF34(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF34_MASK) >> LCD_WF_WF34_SHIFT)
#define LCD_BRD_WF_WF34(base, index) (LCD_RD_WF_WF34(base, index))

/*! @brief Set the WF34 field to a new value. */
#define LCD_WR_WF_WF34(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF34_MASK, LCD_WF_WF34(value)))
#define LCD_BWR_WF_WF34(base, index, value) (LCD_WR_WF_WF34(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF50[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P50 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF50 field. */
#define LCD_RD_WF_WF50(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF50_MASK) >> LCD_WF_WF50_SHIFT)
#define LCD_BRD_WF_WF50(base, index) (LCD_RD_WF_WF50(base, index))

/*! @brief Set the WF50 field to a new value. */
#define LCD_WR_WF_WF50(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF50_MASK, LCD_WF_WF50(value)))
#define LCD_BWR_WF_WF50(base, index, value) (LCD_WR_WF_WF50(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF14[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P14 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF14 field. */
#define LCD_RD_WF_WF14(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF14_MASK) >> LCD_WF_WF14_SHIFT)
#define LCD_BRD_WF_WF14(base, index) (LCD_RD_WF_WF14(base, index))

/*! @brief Set the WF14 field to a new value. */
#define LCD_WR_WF_WF14(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF14_MASK, LCD_WF_WF14(value)))
#define LCD_BWR_WF_WF14(base, index, value) (LCD_WR_WF_WF14(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF54[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P54 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF54 field. */
#define LCD_RD_WF_WF54(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF54_MASK) >> LCD_WF_WF54_SHIFT)
#define LCD_BRD_WF_WF54(base, index) (LCD_RD_WF_WF54(base, index))

/*! @brief Set the WF54 field to a new value. */
#define LCD_WR_WF_WF54(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF54_MASK, LCD_WF_WF54(value)))
#define LCD_BWR_WF_WF54(base, index, value) (LCD_WR_WF_WF54(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF2[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P2 as described above for WF3.
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF2 field. */
#define LCD_RD_WF_WF2(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF2_MASK) >> LCD_WF_WF2_SHIFT)
#define LCD_BRD_WF_WF2(base, index) (LCD_RD_WF_WF2(base, index))

/*! @brief Set the WF2 field to a new value. */
#define LCD_WR_WF_WF2(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF2_MASK, LCD_WF_WF2(value)))
#define LCD_BWR_WF_WF2(base, index, value) (LCD_WR_WF_WF2(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF58[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P58 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF58 field. */
#define LCD_RD_WF_WF58(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF58_MASK) >> LCD_WF_WF58_SHIFT)
#define LCD_BRD_WF_WF58(base, index) (LCD_RD_WF_WF58(base, index))

/*! @brief Set the WF58 field to a new value. */
#define LCD_WR_WF_WF58(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF58_MASK, LCD_WF_WF58(value)))
#define LCD_BWR_WF_WF58(base, index, value) (LCD_WR_WF_WF58(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF30[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P30 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF30 field. */
#define LCD_RD_WF_WF30(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF30_MASK) >> LCD_WF_WF30_SHIFT)
#define LCD_BRD_WF_WF30(base, index) (LCD_RD_WF_WF30(base, index))

/*! @brief Set the WF30 field to a new value. */
#define LCD_WR_WF_WF30(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF30_MASK, LCD_WF_WF30(value)))
#define LCD_BWR_WF_WF30(base, index, value) (LCD_WR_WF_WF30(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF62[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P62 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF62 field. */
#define LCD_RD_WF_WF62(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF62_MASK) >> LCD_WF_WF62_SHIFT)
#define LCD_BRD_WF_WF62(base, index) (LCD_RD_WF_WF62(base, index))

/*! @brief Set the WF62 field to a new value. */
#define LCD_WR_WF_WF62(base, index, value) (LCD_RMW_WF(base, index, LCD_WF_WF62_MASK, LCD_WF_WF62(value)))
#define LCD_BWR_WF_WF62(base, index, value) (LCD_WR_WF_WF62(base, index, value))
/*@}*/

/*!
 * @name Register LCD_WF, field WF10[23:16] (RW)
 *
 * Controls segments or phases connected to LCD_P10 as described above for
 * WF3TO0[WF3].
 */
/*@{*/
/*! @brief Read current value of the LCD_WF_WF10 field. */
#define LCD_RD_WF_WF10(base, index) ((LCD_WF_REG(base, index) & LCD_WF_WF10_MASK) >> LCD_WF_WF10_SHIFT)
#define LCD_BRD_WF_WF10(base, index) (LCD_RD_WF_WF10(base, index))

