RT-Thread/rt-thread/bsp/freescale/platform/devices/MK40D10/include/MK40D10_extension.h
/*! @brief Set the BPALCD49 field to a new value. */
#define LCD_WR_WF8B_BPALCD49(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD49_MASK, LCD_WF8B_BPALCD49(value)))
#define LCD_BWR_WF8B_BPALCD49(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD49_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD48[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD48 field. */
#define LCD_RD_WF8B_BPALCD48(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD48_MASK) >> LCD_WF8B_BPALCD48_SHIFT)
#define LCD_BRD_WF8B_BPALCD48(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD48_SHIFT))

/*! @brief Set the BPALCD48 field to a new value. */
#define LCD_WR_WF8B_BPALCD48(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD48_MASK, LCD_WF8B_BPALCD48(value)))
#define LCD_BWR_WF8B_BPALCD48(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD48_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD47[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD47 field. */
#define LCD_RD_WF8B_BPALCD47(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD47_MASK) >> LCD_WF8B_BPALCD47_SHIFT)
#define LCD_BRD_WF8B_BPALCD47(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD47_SHIFT))

/*! @brief Set the BPALCD47 field to a new value. */
#define LCD_WR_WF8B_BPALCD47(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD47_MASK, LCD_WF8B_BPALCD47(value)))
#define LCD_BWR_WF8B_BPALCD47(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD47_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD46[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD46 field. */
#define LCD_RD_WF8B_BPALCD46(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD46_MASK) >> LCD_WF8B_BPALCD46_SHIFT)
#define LCD_BRD_WF8B_BPALCD46(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD46_SHIFT))

/*! @brief Set the BPALCD46 field to a new value. */
#define LCD_WR_WF8B_BPALCD46(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD46_MASK, LCD_WF8B_BPALCD46(value)))
#define LCD_BWR_WF8B_BPALCD46(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD46_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD45[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD45 field. */
#define LCD_RD_WF8B_BPALCD45(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD45_MASK) >> LCD_WF8B_BPALCD45_SHIFT)
#define LCD_BRD_WF8B_BPALCD45(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD45_SHIFT))

/*! @brief Set the BPALCD45 field to a new value. */
#define LCD_WR_WF8B_BPALCD45(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD45_MASK, LCD_WF8B_BPALCD45(value)))
#define LCD_BWR_WF8B_BPALCD45(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD45_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD44[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD44 field. */
#define LCD_RD_WF8B_BPALCD44(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD44_MASK) >> LCD_WF8B_BPALCD44_SHIFT)
#define LCD_BRD_WF8B_BPALCD44(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD44_SHIFT))

/*! @brief Set the BPALCD44 field to a new value. */
#define LCD_WR_WF8B_BPALCD44(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD44_MASK, LCD_WF8B_BPALCD44(value)))
#define LCD_BWR_WF8B_BPALCD44(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD44_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD43[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD43 field. */
#define LCD_RD_WF8B_BPALCD43(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD43_MASK) >> LCD_WF8B_BPALCD43_SHIFT)
#define LCD_BRD_WF8B_BPALCD43(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD43_SHIFT))

/*! @brief Set the BPALCD43 field to a new value. */
#define LCD_WR_WF8B_BPALCD43(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD43_MASK, LCD_WF8B_BPALCD43(value)))
#define LCD_BWR_WF8B_BPALCD43(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD43_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD3[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD3 field. */
#define LCD_RD_WF8B_BPALCD3(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD3_MASK) >> LCD_WF8B_BPALCD3_SHIFT)
#define LCD_BRD_WF8B_BPALCD3(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD3_SHIFT))

/*! @brief Set the BPALCD3 field to a new value. */
#define LCD_WR_WF8B_BPALCD3(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPALCD3_MASK, LCD_WF8B_BPALCD3(value)))
#define LCD_BWR_WF8B_BPALCD3(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD3_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPALCD42[0] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase A
 * - 0b1 - LCD segment on or LCD backplane active for phase A
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPALCD42 field. */
#define LCD_RD_WF8B_BPALCD42(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPALCD42_MASK) >> LCD_WF8B_BPALCD42_SHIFT)
#define LCD_BRD_WF8B_BPALCD42(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPALCD42_SHIFT))

