RT-Thread/rt-thread/bsp/freescale/platform/devices/MK40D10/include/MK40D10_extension.h
/*! @brief Set the BPFLCD0 field to a new value. */
#define LCD_WR_WF8B_BPFLCD0(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD0_MASK, LCD_WF8B_BPFLCD0(value)))
#define LCD_BWR_WF8B_BPFLCD0(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD46[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD46 field. */
#define LCD_RD_WF8B_BPFLCD46(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD46_MASK) >> LCD_WF8B_BPFLCD46_SHIFT)
#define LCD_BRD_WF8B_BPFLCD46(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD46_SHIFT))

/*! @brief Set the BPFLCD46 field to a new value. */
#define LCD_WR_WF8B_BPFLCD46(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD46_MASK, LCD_WF8B_BPFLCD46(value)))
#define LCD_BWR_WF8B_BPFLCD46(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD46_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD58[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD58 field. */
#define LCD_RD_WF8B_BPFLCD58(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD58_MASK) >> LCD_WF8B_BPFLCD58_SHIFT)
#define LCD_BRD_WF8B_BPFLCD58(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD58_SHIFT))

/*! @brief Set the BPFLCD58 field to a new value. */
#define LCD_WR_WF8B_BPFLCD58(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD58_MASK, LCD_WF8B_BPFLCD58(value)))
#define LCD_BWR_WF8B_BPFLCD58(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD58_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD26[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD26 field. */
#define LCD_RD_WF8B_BPFLCD26(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD26_MASK) >> LCD_WF8B_BPFLCD26_SHIFT)
#define LCD_BRD_WF8B_BPFLCD26(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD26_SHIFT))

/*! @brief Set the BPFLCD26 field to a new value. */
#define LCD_WR_WF8B_BPFLCD26(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD26_MASK, LCD_WF8B_BPFLCD26(value)))
#define LCD_BWR_WF8B_BPFLCD26(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD26_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD36[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD36 field. */
#define LCD_RD_WF8B_BPFLCD36(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD36_MASK) >> LCD_WF8B_BPFLCD36_SHIFT)
#define LCD_BRD_WF8B_BPFLCD36(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD36_SHIFT))

/*! @brief Set the BPFLCD36 field to a new value. */
#define LCD_WR_WF8B_BPFLCD36(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD36_MASK, LCD_WF8B_BPFLCD36(value)))
#define LCD_BWR_WF8B_BPFLCD36(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD36_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD10[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD10 field. */
#define LCD_RD_WF8B_BPFLCD10(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD10_MASK) >> LCD_WF8B_BPFLCD10_SHIFT)
#define LCD_BRD_WF8B_BPFLCD10(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD10_SHIFT))

/*! @brief Set the BPFLCD10 field to a new value. */
#define LCD_WR_WF8B_BPFLCD10(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD10_MASK, LCD_WF8B_BPFLCD10(value)))
#define LCD_BWR_WF8B_BPFLCD10(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD10_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD52[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD52 field. */
#define LCD_RD_WF8B_BPFLCD52(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD52_MASK) >> LCD_WF8B_BPFLCD52_SHIFT)
#define LCD_BRD_WF8B_BPFLCD52(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD52_SHIFT))

/*! @brief Set the BPFLCD52 field to a new value. */
#define LCD_WR_WF8B_BPFLCD52(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD52_MASK, LCD_WF8B_BPFLCD52(value)))
#define LCD_BWR_WF8B_BPFLCD52(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD52_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD57[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD57 field. */
#define LCD_RD_WF8B_BPFLCD57(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD57_MASK) >> LCD_WF8B_BPFLCD57_SHIFT)
#define LCD_BRD_WF8B_BPFLCD57(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD57_SHIFT))

/*! @brief Set the BPFLCD57 field to a new value. */
#define LCD_WR_WF8B_BPFLCD57(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD57_MASK, LCD_WF8B_BPFLCD57(value)))
#define LCD_BWR_WF8B_BPFLCD57(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD57_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD27[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD27 field. */
#define LCD_RD_WF8B_BPFLCD27(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD27_MASK) >> LCD_WF8B_BPFLCD27_SHIFT)
#define LCD_BRD_WF8B_BPFLCD27(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD27_SHIFT))

/*! @brief Set the BPFLCD27 field to a new value. */
#define LCD_WR_WF8B_BPFLCD27(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD27_MASK, LCD_WF8B_BPFLCD27(value)))
#define LCD_BWR_WF8B_BPFLCD27(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD27_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD11[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD11 field. */
#define LCD_RD_WF8B_BPFLCD11(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD11_MASK) >> LCD_WF8B_BPFLCD11_SHIFT)
#define LCD_BRD_WF8B_BPFLCD11(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD11_SHIFT))

/*! @brief Set the BPFLCD11 field to a new value. */
#define LCD_WR_WF8B_BPFLCD11(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD11_MASK, LCD_WF8B_BPFLCD11(value)))
#define LCD_BWR_WF8B_BPFLCD11(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD11_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD56[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD56 field. */
#define LCD_RD_WF8B_BPFLCD56(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD56_MASK) >> LCD_WF8B_BPFLCD56_SHIFT)
#define LCD_BRD_WF8B_BPFLCD56(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD56_SHIFT))

