RT-Thread/rt-thread/bsp/freescale/platform/devices/MK40D10/include/MK40D10_extension.h
/*! @brief Set the BPFLCD29 field to a new value. */
#define LCD_WR_WF8B_BPFLCD29(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD29_MASK, LCD_WF8B_BPFLCD29(value)))
#define LCD_BWR_WF8B_BPFLCD29(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD29_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD50[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD50 field. */
#define LCD_RD_WF8B_BPFLCD50(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD50_MASK) >> LCD_WF8B_BPFLCD50_SHIFT)
#define LCD_BRD_WF8B_BPFLCD50(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD50_SHIFT))

/*! @brief Set the BPFLCD50 field to a new value. */
#define LCD_WR_WF8B_BPFLCD50(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD50_MASK, LCD_WF8B_BPFLCD50(value)))
#define LCD_BWR_WF8B_BPFLCD50(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD50_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD18[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD18 field. */
#define LCD_RD_WF8B_BPFLCD18(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD18_MASK) >> LCD_WF8B_BPFLCD18_SHIFT)
#define LCD_BRD_WF8B_BPFLCD18(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD18_SHIFT))

/*! @brief Set the BPFLCD18 field to a new value. */
#define LCD_WR_WF8B_BPFLCD18(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD18_MASK, LCD_WF8B_BPFLCD18(value)))
#define LCD_BWR_WF8B_BPFLCD18(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD18_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD34[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD34 field. */
#define LCD_RD_WF8B_BPFLCD34(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD34_MASK) >> LCD_WF8B_BPFLCD34_SHIFT)
#define LCD_BRD_WF8B_BPFLCD34(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD34_SHIFT))

/*! @brief Set the BPFLCD34 field to a new value. */
#define LCD_WR_WF8B_BPFLCD34(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD34_MASK, LCD_WF8B_BPFLCD34(value)))
#define LCD_BWR_WF8B_BPFLCD34(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD34_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD19[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD19 field. */
#define LCD_RD_WF8B_BPFLCD19(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD19_MASK) >> LCD_WF8B_BPFLCD19_SHIFT)
#define LCD_BRD_WF8B_BPFLCD19(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD19_SHIFT))

/*! @brief Set the BPFLCD19 field to a new value. */
#define LCD_WR_WF8B_BPFLCD19(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD19_MASK, LCD_WF8B_BPFLCD19(value)))
#define LCD_BWR_WF8B_BPFLCD19(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD19_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD2[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD2 field. */
#define LCD_RD_WF8B_BPFLCD2(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD2_MASK) >> LCD_WF8B_BPFLCD2_SHIFT)
#define LCD_BRD_WF8B_BPFLCD2(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD2_SHIFT))

/*! @brief Set the BPFLCD2 field to a new value. */
#define LCD_WR_WF8B_BPFLCD2(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD2_MASK, LCD_WF8B_BPFLCD2(value)))
#define LCD_BWR_WF8B_BPFLCD2(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD2_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD9[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD9 field. */
#define LCD_RD_WF8B_BPFLCD9(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD9_MASK) >> LCD_WF8B_BPFLCD9_SHIFT)
#define LCD_BRD_WF8B_BPFLCD9(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD9_SHIFT))

/*! @brief Set the BPFLCD9 field to a new value. */
#define LCD_WR_WF8B_BPFLCD9(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD9_MASK, LCD_WF8B_BPFLCD9(value)))
#define LCD_BWR_WF8B_BPFLCD9(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD9_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD3[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD3 field. */
#define LCD_RD_WF8B_BPFLCD3(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD3_MASK) >> LCD_WF8B_BPFLCD3_SHIFT)
#define LCD_BRD_WF8B_BPFLCD3(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD3_SHIFT))

/*! @brief Set the BPFLCD3 field to a new value. */
#define LCD_WR_WF8B_BPFLCD3(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPFLCD3_MASK, LCD_WF8B_BPFLCD3(value)))
#define LCD_BWR_WF8B_BPFLCD3(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD3_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPFLCD37[5] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase F
 * - 0b1 - LCD segment on or LCD backplane active for phase F
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPFLCD37 field. */
#define LCD_RD_WF8B_BPFLCD37(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPFLCD37_MASK) >> LCD_WF8B_BPFLCD37_SHIFT)
#define LCD_BRD_WF8B_BPFLCD37(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPFLCD37_SHIFT))

