RT-Thread/rt-thread/bsp/freescale/platform/devices/MK40D10/include/MK40D10_extension.h
/*! @brief Set the BPHLCD33 field to a new value. */
#define LCD_WR_WF8B_BPHLCD33(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD33_MASK, LCD_WF8B_BPHLCD33(value)))
#define LCD_BWR_WF8B_BPHLCD33(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD33_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD32[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD32 field. */
#define LCD_RD_WF8B_BPHLCD32(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD32_MASK) >> LCD_WF8B_BPHLCD32_SHIFT)
#define LCD_BRD_WF8B_BPHLCD32(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD32_SHIFT))

/*! @brief Set the BPHLCD32 field to a new value. */
#define LCD_WR_WF8B_BPHLCD32(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD32_MASK, LCD_WF8B_BPHLCD32(value)))
#define LCD_BWR_WF8B_BPHLCD32(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD32_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD31[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD31 field. */
#define LCD_RD_WF8B_BPHLCD31(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD31_MASK) >> LCD_WF8B_BPHLCD31_SHIFT)
#define LCD_BRD_WF8B_BPHLCD31(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD31_SHIFT))

/*! @brief Set the BPHLCD31 field to a new value. */
#define LCD_WR_WF8B_BPHLCD31(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD31_MASK, LCD_WF8B_BPHLCD31(value)))
#define LCD_BWR_WF8B_BPHLCD31(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD31_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD30[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD30 field. */
#define LCD_RD_WF8B_BPHLCD30(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD30_MASK) >> LCD_WF8B_BPHLCD30_SHIFT)
#define LCD_BRD_WF8B_BPHLCD30(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD30_SHIFT))

/*! @brief Set the BPHLCD30 field to a new value. */
#define LCD_WR_WF8B_BPHLCD30(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD30_MASK, LCD_WF8B_BPHLCD30(value)))
#define LCD_BWR_WF8B_BPHLCD30(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD30_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD29[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD29 field. */
#define LCD_RD_WF8B_BPHLCD29(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD29_MASK) >> LCD_WF8B_BPHLCD29_SHIFT)
#define LCD_BRD_WF8B_BPHLCD29(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD29_SHIFT))

/*! @brief Set the BPHLCD29 field to a new value. */
#define LCD_WR_WF8B_BPHLCD29(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD29_MASK, LCD_WF8B_BPHLCD29(value)))
#define LCD_BWR_WF8B_BPHLCD29(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD29_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD4[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD4 field. */
#define LCD_RD_WF8B_BPHLCD4(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD4_MASK) >> LCD_WF8B_BPHLCD4_SHIFT)
#define LCD_BRD_WF8B_BPHLCD4(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD4_SHIFT))

/*! @brief Set the BPHLCD4 field to a new value. */
#define LCD_WR_WF8B_BPHLCD4(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD4_MASK, LCD_WF8B_BPHLCD4(value)))
#define LCD_BWR_WF8B_BPHLCD4(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD4_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD28[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD28 field. */
#define LCD_RD_WF8B_BPHLCD28(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD28_MASK) >> LCD_WF8B_BPHLCD28_SHIFT)
#define LCD_BRD_WF8B_BPHLCD28(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD28_SHIFT))

/*! @brief Set the BPHLCD28 field to a new value. */
#define LCD_WR_WF8B_BPHLCD28(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD28_MASK, LCD_WF8B_BPHLCD28(value)))
#define LCD_BWR_WF8B_BPHLCD28(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD28_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD27[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD27 field. */
#define LCD_RD_WF8B_BPHLCD27(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD27_MASK) >> LCD_WF8B_BPHLCD27_SHIFT)
#define LCD_BRD_WF8B_BPHLCD27(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD27_SHIFT))

/*! @brief Set the BPHLCD27 field to a new value. */
#define LCD_WR_WF8B_BPHLCD27(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD27_MASK, LCD_WF8B_BPHLCD27(value)))
#define LCD_BWR_WF8B_BPHLCD27(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD27_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD26[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD26 field. */
#define LCD_RD_WF8B_BPHLCD26(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD26_MASK) >> LCD_WF8B_BPHLCD26_SHIFT)
#define LCD_BRD_WF8B_BPHLCD26(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD26_SHIFT))

