RT-Thread/rt-thread/bsp/freescale/platform/devices/MK40D10/include/MK40D10_extension.h
/*! @brief Set the BPHLCD26 field to a new value. */
#define LCD_WR_WF8B_BPHLCD26(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD26_MASK, LCD_WF8B_BPHLCD26(value)))
#define LCD_BWR_WF8B_BPHLCD26(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD26_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD25[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD25 field. */
#define LCD_RD_WF8B_BPHLCD25(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD25_MASK) >> LCD_WF8B_BPHLCD25_SHIFT)
#define LCD_BRD_WF8B_BPHLCD25(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD25_SHIFT))

/*! @brief Set the BPHLCD25 field to a new value. */
#define LCD_WR_WF8B_BPHLCD25(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD25_MASK, LCD_WF8B_BPHLCD25(value)))
#define LCD_BWR_WF8B_BPHLCD25(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD25_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD24[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD24 field. */
#define LCD_RD_WF8B_BPHLCD24(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD24_MASK) >> LCD_WF8B_BPHLCD24_SHIFT)
#define LCD_BRD_WF8B_BPHLCD24(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD24_SHIFT))

/*! @brief Set the BPHLCD24 field to a new value. */
#define LCD_WR_WF8B_BPHLCD24(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD24_MASK, LCD_WF8B_BPHLCD24(value)))
#define LCD_BWR_WF8B_BPHLCD24(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD24_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD23[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD23 field. */
#define LCD_RD_WF8B_BPHLCD23(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD23_MASK) >> LCD_WF8B_BPHLCD23_SHIFT)
#define LCD_BRD_WF8B_BPHLCD23(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD23_SHIFT))

/*! @brief Set the BPHLCD23 field to a new value. */
#define LCD_WR_WF8B_BPHLCD23(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD23_MASK, LCD_WF8B_BPHLCD23(value)))
#define LCD_BWR_WF8B_BPHLCD23(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD23_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD22[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD22 field. */
#define LCD_RD_WF8B_BPHLCD22(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD22_MASK) >> LCD_WF8B_BPHLCD22_SHIFT)
#define LCD_BRD_WF8B_BPHLCD22(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD22_SHIFT))

/*! @brief Set the BPHLCD22 field to a new value. */
#define LCD_WR_WF8B_BPHLCD22(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD22_MASK, LCD_WF8B_BPHLCD22(value)))
#define LCD_BWR_WF8B_BPHLCD22(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD22_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD5[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD5 field. */
#define LCD_RD_WF8B_BPHLCD5(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD5_MASK) >> LCD_WF8B_BPHLCD5_SHIFT)
#define LCD_BRD_WF8B_BPHLCD5(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD5_SHIFT))

/*! @brief Set the BPHLCD5 field to a new value. */
#define LCD_WR_WF8B_BPHLCD5(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD5_MASK, LCD_WF8B_BPHLCD5(value)))
#define LCD_BWR_WF8B_BPHLCD5(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD5_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD21[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD21 field. */
#define LCD_RD_WF8B_BPHLCD21(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD21_MASK) >> LCD_WF8B_BPHLCD21_SHIFT)
#define LCD_BRD_WF8B_BPHLCD21(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD21_SHIFT))

/*! @brief Set the BPHLCD21 field to a new value. */
#define LCD_WR_WF8B_BPHLCD21(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD21_MASK, LCD_WF8B_BPHLCD21(value)))
#define LCD_BWR_WF8B_BPHLCD21(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD21_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD20[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD20 field. */
#define LCD_RD_WF8B_BPHLCD20(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD20_MASK) >> LCD_WF8B_BPHLCD20_SHIFT)
#define LCD_BRD_WF8B_BPHLCD20(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD20_SHIFT))

/*! @brief Set the BPHLCD20 field to a new value. */
#define LCD_WR_WF8B_BPHLCD20(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD20_MASK, LCD_WF8B_BPHLCD20(value)))
#define LCD_BWR_WF8B_BPHLCD20(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD20_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD19[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD19 field. */
#define LCD_RD_WF8B_BPHLCD19(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD19_MASK) >> LCD_WF8B_BPHLCD19_SHIFT)
#define LCD_BRD_WF8B_BPHLCD19(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD19_SHIFT))

/*! @brief Set the BPHLCD19 field to a new value. */
#define LCD_WR_WF8B_BPHLCD19(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD19_MASK, LCD_WF8B_BPHLCD19(value)))
#define LCD_BWR_WF8B_BPHLCD19(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD19_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD18[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD18 field. */
#define LCD_RD_WF8B_BPHLCD18(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD18_MASK) >> LCD_WF8B_BPHLCD18_SHIFT)
#define LCD_BRD_WF8B_BPHLCD18(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD18_SHIFT))

/*! @brief Set the BPHLCD18 field to a new value. */
#define LCD_WR_WF8B_BPHLCD18(base, index, value) (LCD_RMW_WF8B(base, index, LCD_WF8B_BPHLCD18_MASK, LCD_WF8B_BPHLCD18(value)))
#define LCD_BWR_WF8B_BPHLCD18(base, index, value) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD18_SHIFT) = (value))
/*@}*/

/*!
 * @name Register LCD_WF8B, field BPHLCD17[7] (RW)
 *
 * Values:
 * - 0b0 - LCD segment off or LCD backplane inactive for phase H
 * - 0b1 - LCD segment on or LCD backplane active for phase H
 */
/*@{*/
/*! @brief Read current value of the LCD_WF8B_BPHLCD17 field. */
#define LCD_RD_WF8B_BPHLCD17(base, index) ((LCD_WF8B_REG(base, index) & LCD_WF8B_BPHLCD17_MASK) >> LCD_WF8B_BPHLCD17_SHIFT)
#define LCD_BRD_WF8B_BPHLCD17(base, index) (BITBAND_ACCESS8(&LCD_WF8B_REG(base, index), LCD_WF8B_BPHLCD17_SHIFT))

