RT-Thread/rt-thread/bsp/freescale/platform/devices/MK40D10/include/MK40D10_extension.h
/*! @brief Set the PEN11 field to a new value. */
#define TSI_WR_PEN_PEN11(base, value) (TSI_RMW_PEN(base, TSI_PEN_PEN11_MASK, TSI_PEN_PEN11(value)))
#define TSI_BWR_PEN_PEN11(base, value) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN11_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_PEN, field PEN12[12] (RW)
 *
 * Values:
 * - 0b0 - The corresponding pin is not used by TSI.
 * - 0b1 - The corresponding pin is used by TSI.
 */
/*@{*/
/*! @brief Read current value of the TSI_PEN_PEN12 field. */
#define TSI_RD_PEN_PEN12(base) ((TSI_PEN_REG(base) & TSI_PEN_PEN12_MASK) >> TSI_PEN_PEN12_SHIFT)
#define TSI_BRD_PEN_PEN12(base) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN12_SHIFT))

/*! @brief Set the PEN12 field to a new value. */
#define TSI_WR_PEN_PEN12(base, value) (TSI_RMW_PEN(base, TSI_PEN_PEN12_MASK, TSI_PEN_PEN12(value)))
#define TSI_BWR_PEN_PEN12(base, value) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN12_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_PEN, field PEN13[13] (RW)
 *
 * Values:
 * - 0b0 - The corresponding pin is not used by TSI.
 * - 0b1 - The corresponding pin is used by TSI.
 */
/*@{*/
/*! @brief Read current value of the TSI_PEN_PEN13 field. */
#define TSI_RD_PEN_PEN13(base) ((TSI_PEN_REG(base) & TSI_PEN_PEN13_MASK) >> TSI_PEN_PEN13_SHIFT)
#define TSI_BRD_PEN_PEN13(base) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN13_SHIFT))

/*! @brief Set the PEN13 field to a new value. */
#define TSI_WR_PEN_PEN13(base, value) (TSI_RMW_PEN(base, TSI_PEN_PEN13_MASK, TSI_PEN_PEN13(value)))
#define TSI_BWR_PEN_PEN13(base, value) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN13_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_PEN, field PEN14[14] (RW)
 *
 * Values:
 * - 0b0 - The corresponding pin is not used by TSI.
 * - 0b1 - The corresponding pin is used by TSI.
 */
/*@{*/
/*! @brief Read current value of the TSI_PEN_PEN14 field. */
#define TSI_RD_PEN_PEN14(base) ((TSI_PEN_REG(base) & TSI_PEN_PEN14_MASK) >> TSI_PEN_PEN14_SHIFT)
#define TSI_BRD_PEN_PEN14(base) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN14_SHIFT))

/*! @brief Set the PEN14 field to a new value. */
#define TSI_WR_PEN_PEN14(base, value) (TSI_RMW_PEN(base, TSI_PEN_PEN14_MASK, TSI_PEN_PEN14(value)))
#define TSI_BWR_PEN_PEN14(base, value) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN14_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_PEN, field PEN15[15] (RW)
 *
 * Values:
 * - 0b0 - The corresponding pin is not used by TSI.
 * - 0b1 - The corresponding pin is used by TSI.
 */
/*@{*/
/*! @brief Read current value of the TSI_PEN_PEN15 field. */
#define TSI_RD_PEN_PEN15(base) ((TSI_PEN_REG(base) & TSI_PEN_PEN15_MASK) >> TSI_PEN_PEN15_SHIFT)
#define TSI_BRD_PEN_PEN15(base) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN15_SHIFT))

/*! @brief Set the PEN15 field to a new value. */
#define TSI_WR_PEN_PEN15(base, value) (TSI_RMW_PEN(base, TSI_PEN_PEN15_MASK, TSI_PEN_PEN15(value)))
#define TSI_BWR_PEN_PEN15(base, value) (BITBAND_ACCESS32(&TSI_PEN_REG(base), TSI_PEN_PEN15_SHIFT) = (value))
/*@}*/

/*!
 * @name Register TSI_PEN, field LPSP[19:16] (RW)
 *
 * Values:
 * - 0b0000 - TSI_IN[0] is active in low-power mode.
 * - 0b0001 - TSI_IN[1] is active in low-power mode.
 * - 0b0010 - TSI_IN[2] is active in low-power mode.
 * - 0b0011 - TSI_IN[3] is active in low-power mode.
 * - 0b0100 - TSI_IN[4] is active in low-power mode.
 * - 0b0101 - TSI_IN[5] is active in low-power mode.
 * - 0b0110 - TSI_IN[6] is active in low-power mode.
 * - 0b0111 - TSI_IN[7] is active in low-power mode.
 * - 0b1000 - TSI_IN[8] is active in low-power mode.
 * - 0b1001 - TSI_IN[9] is active in low-power mode.
 * - 0b1010 - TSI_IN[10] is active in low-power mode.
 * - 0b1011 - TSI_IN[11] is active in low-power mode.
 * - 0b1100 - TSI_IN[12] is active in low-power mode.
 * - 0b1101 - TSI_IN[13] is active in low-power mode.
 * - 0b1110 - TSI_IN[14] is active in low-power mode.
 * - 0b1111 - TSI_IN[15] is active in low-power mode.
 */
/*@{*/
/*! @brief Read current value of the TSI_PEN_LPSP field. */
#define TSI_RD_PEN_LPSP(base) ((TSI_PEN_REG(base) & TSI_PEN_LPSP_MASK) >> TSI_PEN_LPSP_SHIFT)
#define TSI_BRD_PEN_LPSP(base) (TSI_RD_PEN_LPSP(base))

/*! @brief Set the LPSP field to a new value. */
#define TSI_WR_PEN_LPSP(base, value) (TSI_RMW_PEN(base, TSI_PEN_LPSP_MASK, TSI_PEN_LPSP(value)))
#define TSI_BWR_PEN_LPSP(base, value) (TSI_WR_PEN_LPSP(base, value))
/*@}*/

/*******************************************************************************
 * TSI_WUCNTR - Wake-Up Channel Counter Register
 ******************************************************************************/

/*!
 * @brief TSI_WUCNTR - Wake-Up Channel Counter Register (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire TSI_WUCNTR register
 */
/*@{*/
#define TSI_RD_WUCNTR(base)      (TSI_WUCNTR_REG(base))
/*@}*/

/*
 * Constants & macros for individual TSI_WUCNTR bitfields
 */

/*!
 * @name Register TSI_WUCNTR, field WUCNT[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the TSI_WUCNTR_WUCNT field. */
#define TSI_RD_WUCNTR_WUCNT(base) ((TSI_WUCNTR_REG(base) & TSI_WUCNTR_WUCNT_MASK) >> TSI_WUCNTR_WUCNT_SHIFT)
#define TSI_BRD_WUCNTR_WUCNT(base) (TSI_RD_WUCNTR_WUCNT(base))
/*@}*/

/*******************************************************************************
 * TSI_CNTR1 - Counter Register
 ******************************************************************************/

/*!
 * @brief TSI_CNTR1 - Counter Register (RO)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire TSI_CNTR1 register
 */
/*@{*/
#define TSI_RD_CNTR1(base)       (TSI_CNTR1_REG(base))
/*@}*/

/*
 * Constants & macros for individual TSI_CNTR1 bitfields
 */

/*!
 * @name Register TSI_CNTR1, field CTN1[15:0] (RO)
 */
/*@{*/
/*! @brief Read current value of the TSI_CNTR1_CTN1 field. */
#define TSI_RD_CNTR1_CTN1(base) ((TSI_CNTR1_REG(base) & TSI_CNTR1_CTN1_MASK) >> TSI_CNTR1_CTN1_SHIFT)
#define TSI_BRD_CNTR1_CTN1(base) (TSI_RD_CNTR1_CTN1(base))
/*@}*/

/*!
 * @name Register TSI_CNTR1, field CTN[31:16] (RO)
 */
/*@{*/
/*! @brief Read current value of the TSI_CNTR1_CTN field. */
#define TSI_RD_CNTR1_CTN(base) ((TSI_CNTR1_REG(base) & TSI_CNTR1_CTN_MASK) >> TSI_CNTR1_CTN_SHIFT)
#define TSI_BRD_CNTR1_CTN(base) (TSI_RD_CNTR1_CTN(base))
/*@}*/

